;

+
{ re:
    { id: "faces@ionify"
    , by: "Michael Lee"
    , at: "2016.09.07...05-07"
    , in: "san-jose.california.usa.earth"
    , is: "Exploring ion faces."
    }
}

Array.prototype.valueOf =
  function onAesop ()
    { console.log ("'" + this[0] + "'")
    }

           ;

       ['• . •']

           +
['õ . õ']  +  ['Õ . Õ']
           +
['ō . ō']  +  ['Ō . Ō']
           +

       ['- . -']

           +
['ö . ö']  +  ['Ö . Ö']
           +
['ô . ô']  +  ['Ô . Ô']
           +

       ['~ . ~']

           +
['ø . ø']  +  ['Ø . Ø']
           +
['o . o']  +  ['O . O']
           +

       ['0 . 0']

           ;

           /*

       +['• . •'];

+['õ . õ'];   +['Õ . Õ'];
+['ō . ō'];   +['Ō . Ō'];
+['ö . ö'];   +['Ö . Ö'];
+['ô . ô'];   +['Ô . Ô'];
+['ø . ø'];   +['Ø . Ø'];
+['o . o'];   +['O . O'];

       +['0 . 0'];

            */